In [70]:
import pandas as pd
import numpy as np
print(pd.__version__)

2.1.2

In [18]:
# read csv file here
salaryData = pd.read_csv('Salaries.csv')

C:\Users\sohal\AppData\Local\Temp\ipykernel_25432\813340719.py:2: DtypeWarning: Columns (3,4,5,6,12) have mixed types. Specify dtype option on import or set low_memory=False.
  salaryData = pd.read_csv('Salaries.csv')

In [ ]:
#  printing all columns to check dataset is true or not
salaryData.columns

In [111]:
# Data types of each column in dataset
salaryData.dtypes

Id                    int64
EmployeeName         object
JobTitle             object
BasePay              object
OvertimePay          object
OtherPay             object
Benefits             object
TotalPay            float64
TotalPayBenefits    float64
Year                  int64
Notes               float64
Agency               object
Status               object
dtype: object

In [ ]:
#  printing information of dataset
salaryData.info()

In [ ]:
# printing short statistics evaluation of dataset
salaryData.describe()

In [ ]:
# Describe statistics of all columns 
salaryData.describe(include='all')

In [ ]:
# Printing null values by columns
salaryData.isnull().sum()

In [ ]:
# Null values by rows
salaryData.isnull().sum(axis=1)

> ### **Q.1] Display top 10 rows of dataset**

In [ ]:
first10rows = salaryData.head(10)
first10rows

> ### **Q.2] Display last 10 rows of dataset**

In [ ]:
last10rows = salaryData.tail(10)
last10rows

> ### **Q.3] Display shape of dataset**

In [29]:
shapeOfDataSet = salaryData.shape
shapeOfDataSet

(148654, 13)

> ### **Q.4] Drop ID,Status,Notes,Agency columns**

In [30]:
salaryData.columns

Index(['Id', 'EmployeeName', 'JobTitle', 'BasePay', 'OvertimePay', 'OtherPay',
       'Benefits', 'TotalPay', 'TotalPayBenefits', 'Year', 'Notes', 'Agency',
       'Status'],
      dtype='object')

In [32]:
newData = salaryData.drop(['Id','Notes','Agency','Status'],axis=1)
newData

,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year
0,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011
1,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011
2,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,NaN,335279.91,335279.91,2011
3,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.0,56120.71,198306.9,NaN,332343.61,332343.61,2011
4,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.6,9737.0,182234.59,NaN,326373.19,326373.19,2011
...,...,...,...,...,...,...,...,...,...
148649,Roy I Tillery,Custodian,0.00,0.00,0.00,0.00,0.00,0.00,2014
148650,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014
148651,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014
148652,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014
148653,Joe Lopez,"Counselor, Log Cabin Ranch",0.00,0.00,-618.13,0.00,-618.13,-618.13,2014

In [33]:
newData.columns

Index(['EmployeeName', 'JobTitle', 'BasePay', 'OvertimePay', 'OtherPay',
       'Benefits', 'TotalPay', 'TotalPayBenefits', 'Year'],
      dtype='object')

> ### **Q.5] Find occurance of employees**

In [34]:
newData.columns

Index(['EmployeeName', 'JobTitle', 'BasePay', 'OvertimePay', 'OtherPay',
       'Benefits', 'TotalPay', 'TotalPayBenefits', 'Year'],
      dtype='object')

In [41]:
newData['EmployeeName'].value_counts(ascending=False)

EmployeeName
Kevin Lee                   13
Richard Lee                 11
Steven Lee                  11
William Wong                11
Stanley Lee                  9
                            ..
Jeffrey Skover               1
Ken Dever                    1
Kevin Whitfield              1
Granville McCollough III     1
Joe Lopez                    1
Name: count, Length: 110811, dtype: int64

In [42]:
newData['EmployeeName'].value_counts(normalize=True)

EmployeeName
Kevin Lee                   0.000087
Richard Lee                 0.000074
Steven Lee                  0.000074
William Wong                0.000074
Stanley Lee                 0.000061
                              ...
Jeffrey Skover              0.000007
Ken Dever                   0.000007
Kevin Whitfield             0.000007
Granville McCollough III    0.000007
Joe Lopez                   0.000007
Name: proportion, Length: 110811, dtype: float64

In [43]:
#  If I need only top 5
newData['EmployeeName'].value_counts().head(5)

EmployeeName
Kevin Lee       13
Richard Lee     11
Steven Lee      11
William Wong    11
Stanley Lee      9
Name: count, dtype: int64

> ### **Q.6] Find Number Of Unique Job Titles**

In [44]:
newData.columns

Index(['EmployeeName', 'JobTitle', 'BasePay', 'OvertimePay', 'OtherPay',
       'Benefits', 'TotalPay', 'TotalPayBenefits', 'Year'],
      dtype='object')

In [45]:
newData['JobTitle'].nunique()

2159

> ### **Q.7] Total number of jobs contain captain**

In [48]:
len(newData[newData['JobTitle'].str.contains('Captain',case=False)])

552

In [51]:
newData[newData['JobTitle'].str.contains('Captain',case=False)].count()

EmployeeName        552
JobTitle            552
BasePay             551
OvertimePay         552
OtherPay            552
Benefits            411
TotalPay            552
TotalPayBenefits    552
Year                552
dtype: int64

> ### **Q.8] Print employee names which are from fire department**

In [56]:
newData[newData['JobTitle'].str.contains('Fire Department',case=False)]['EmployeeName']

4              PATRICK GARDNER
6                    ALSON LEE
8               MICHAEL MORRIS
9           JOANNE HAYES-WHITE
10               ARTHUR KENNEY
                  ...
32623             JAMES BARDEN
36162       Joanne Hayes-White
72926     Joanne M Hayes-White
102303          Robert E Evans
110535    Joanne M Hayes-White
Name: EmployeeName, Length: 226, dtype: object

In [57]:
newData[newData['JobTitle'].str.contains('Fire Department',case=False)]['EmployeeName'].count()

226

> ### **Q.9] Print employee names which are from fire departmentFin min,max and average base pay**

In [58]:
newData.columns

Index(['EmployeeName', 'JobTitle', 'BasePay', 'OvertimePay', 'OtherPay',
       'Benefits', 'TotalPay', 'TotalPayBenefits', 'Year'],
      dtype='object')

In [69]:
newData['BasePay']

0            167411.18
1            155966.02
2            212739.13
3              77916.0
4             134401.6
              ...
148649            0.00
148650    Not Provided
148651    Not Provided
148652    Not Provided
148653            0.00
Name: BasePay, Length: 148654, dtype: object

In [61]:
newData['BasePay'].describe()

count     148049.0
unique    109900.0
top            0.0
freq         875.0
Name: BasePay, dtype: float64

In [ ]:
maxValueInBasepaycol = newData['BasePay'].max()
maxValueInBasepaycol

> ### **Q.10] Replace not provided by NaN**

> ##### **To perform this we need to take help of numpy library**
---
>##### **We have replace function there**

In [ ]:
newData.replace('Not provided',np.nan)

> ### **Q.11] Drop the rows having 5 missing values**

In [78]:
len(newData[newData.isnull().sum(axis=1) == 5])

0

In [79]:
# There are no any rows whose 
# But if you have to perform drop operation you can do like below
# newData.drop(newData[newData.isnull().sum(axis=1) == 5].index,axis=0,inplace=True)

> ### **Q.12] DJob title of albert pardini**

In [83]:
newData[newData['EmployeeName']==('ALBERT PARDINI')]

,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year
2,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,NaN,335279.91,335279.91,2011

> ### **Q.13] How much albert pardini make(including benefits)**

In [85]:
newData[newData['EmployeeName']=='ALBERT PARDINI']['TotalPayBenefits']

2    335279.91
Name: TotalPayBenefits, dtype: float64

> ### **Q.14] NAME OF THE PERSON HAVING HIGHEST TotalPay**

In [109]:
newData[newData['TotalPay'].max()==newData['TotalPay']]['EmployeeName']

0    NATHANIEL FORD
Name: EmployeeName, dtype: object

> ### **Q.15] Average Total pay per year**

In [ ]:
# total = np.array()
# total.mean()
newData.groupby('Year').mean()['TotalPay']